#구글에 pypi 를 검색해서 브라우저 프로젝트에 들어가서
#어사이드부분에 DB web game 등등 필요한걸 찾아서
#필요한거에 들어가서 왼쪽 상단에 링크 복사
#아래 터미널창에서 복사했던거 붙여넣으면 알아서 인스톨 완료
#다시 홈페이지에서 임포트부분이나 사용법 긁어와서 사용하기
#터미널에 pip list 를 치면 설치되어있는 리스트를 나타내줌
#혹여 새로운 버전이 나와서 업그레이드가 필요하다면 pip install --upgrade pip이름
#삭제를 하려면 pip uninstall pip이름

#내장 함수
print(input("값을 입력해주세요 : "))

#dir어떤걸 쓸수 있는지 알려주는코드
print(dir()) #이렇게 하면 지금 사용할 수 있는 것들을 보여줌

import random
print(dir(random)) #이렇게하면 랜덤 함수에서 사용할 수 있는 것들을 다 출력해줌

#구글에 list of python bulitins 를 치면 파이썬에서 사용가능한 내장함수등등을 다 설명해줌
